Repository: WelliSolutions/HugeJsonViewer
Catalog: src/Properties/Resources.*.resx
Languages: de

# ConvertingJsonCaption
source: Converting into display data
de: Konvertiere in Anzeigeformat

# ConvertingJsonWaitMessage
source: Please wait...
de: Bitte warten...

# DisplayingJsonCaption
source: Displaying
de: Zeige an

# DisplayingJsonWaitMessage
source: Please wait...
de: Bitte warten...

# ErrorAccessingFile
source: Error accessing file: {0} {1}
de: Fehler beim Zugriff auf die Datei {0} {1}

source: Error loading JSON
de: Fehler beim Laden des JSON

# ErrorParsingJson
source: Error parsing JSON: {0} {1}
de: Fehler beim Parsen des JSON: {0} {1}

# FileNotFound
source: File not found: {0}
de: Datei nicht gefunden: {0}

# FileTooLargeWarning
source: The file size ({0}) might not fit into the memory of your PC. If so, it will slow down things tremendously. Continue anyway?
de: Die Datei ist so groß ({0}), dass sie nicht in den Speicher des PCs passen könnte. Falls das eintritt, wird alles sehr langsam. Trotzdem fortfahren?

# InvalidFileName
source: Invalid file name: {0} {1}
de: Ungültiger Dateiname: {0} {1}

# ParsingJsonCaption
source: Parsing JSON
de: Parse das JSON

# ParsingJsonWaitMessage
source: Please wait...
de: Bitte warten...

source: Performance warning
de: Performance Warnung

# AboutMessage
source: Huge JSON Viewer Program to view large JSON files. Source code: https://github.com/WelliSolutions/HugeJsonViewer Icons: https://tabler-icons.io/
de: Huge JSON Viewer Programm zur Ansicht riesiger JSON Dateien. Quellcode: https://github.com/WelliSolutions/HugeJsonViewer Icons: https://tabler-icons.io/

# AboutTitle
source: About
de: Über

# MaybeNewlineDelimitedCaption
source: File size mismatch
de: Dateigröße unstimmig

# MaybeNewlineDelimited
source: The file was read and parsing the JSON completed. However, not the whole file was read. There's more data in the file than will be displayed by HugeJsonViewer. Perhaps you have opened a NDJSON file (newline delimited JSON) instead of a regular JSON file. NDJSON is currently not supported. Only the first object will be displayed.
de: Die Datei wurde gelesen und die Erfassung des JSON ist erfolgreich abgeschlossen. Jedoch wurde nicht die gesamte Datei gelesen. Es gibt in der Datei weitere Daten, die von HugeJsonViewer nicht angezeigt werden. Vielleicht haben Sie eine NDJSON Datei (Newline Delimited JSON) geöffnet, anstatt einer JSON Datei. NDJSON wird derzeit nicht unterstützt. Nur das erste Objekt wird angezeigt.
